server/stress/test.yml

config:
  target: 'http://localhost:3002'
  processor: './config.js'
  ensure:
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 10
      maxVusers: 10
      name: "10 users"
    - duration: 30
      arrivalRate: 10
      rampTo: 100
      maxVusers: 100
      name: "100 users"
    - duration: 60
      arrivalRate: 100
      rampTo: 1000
      maxVusers: 1000
      name: "1000 users"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Get items details"
    weight: 10
    flow:
    - function: "randomId"
    - get:
        url: "/?={id}"
    # - log: "GET request with ID: {{id}}"
  - name: "Create new item"
    weight: 2
    flow:
    - function: "randomItem"
    - post:
        url: "/items/"
        json:
          id: "{{ id }}"
          productName: "{{ productName }}"
          producer: "{{ producer }}"
          answeredQuestions: "{{ answeredQuestions }}"
          price: "{{ price }}"
          inStock: "{{ inStock }}"
          starPercentages: "{{ starPercentages }} "
          numberOfRatings: "{{ numberOfRatings }}"
          productInfo: "{{ productInfo }}"
    # - log: "POST request with ID: {{id}}"